{"format": "layers-model", "generatedBy": "keras v3.9.1", "convertedBy": "TensorFlow.js Converter v4.22.0", "modelTopology": {"keras_version": "3.9.1", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "layers": [{"class_name": "InputLayer", "config": {"batch_shape": [1024, 300], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_layer"}}, {"class_name": "Embedding", "config": {"name": "embedding", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "input_dim": 290419, "output_dim": 300, "embeddings_initializer": {"module": "keras.initializers", "class_name": "RandomUniform", "config": {"seed": null, "minval": -0.05, "maxval": 0.05}, "registered_name": null}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false}}, {"class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "rate": 0.5, "seed": null, "noise_shape": null}}, {"class_name": "LSTM", "config": {"name": "lstm", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "zero_output_for_mask": false, "units": 100, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "recurrent_initializer": {"module": "keras.initializers", "class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.2, "recurrent_dropout": 0.2, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}], "build_input_shape": [1024, 300]}}, "training_config": {"loss": "binary_crossentropy", "loss_weights": null, "metrics": ["accuracy"], "weighted_metrics": null, "run_eagerly": false, "steps_per_execution": 1, "jit_compile": false, "optimizer_config": {"class_name": "Adam", "config": {"name": "adam", "learning_rate": 0.0010000000474974513, "weight_decay": null, "clipnorm": null, "global_clipnorm": null, "clipvalue": null, "use_ema": false, "ema_momentum": 0.99, "ema_overwrite_frequency": null, "loss_scale_factor": null, "gradient_accumulation_steps": null, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of84.bin", "group1-shard2of84.bin", "group1-shard3of84.bin", "group1-shard4of84.bin", "group1-shard5of84.bin", "group1-shard6of84.bin", "group1-shard7of84.bin", "group1-shard8of84.bin", "group1-shard9of84.bin", "group1-shard10of84.bin", "group1-shard11of84.bin", "group1-shard12of84.bin", "group1-shard13of84.bin", "group1-shard14of84.bin", "group1-shard15of84.bin", "group1-shard16of84.bin", "group1-shard17of84.bin", "group1-shard18of84.bin", "group1-shard19of84.bin", "group1-shard20of84.bin", "group1-shard21of84.bin", "group1-shard22of84.bin", "group1-shard23of84.bin", "group1-shard24of84.bin", "group1-shard25of84.bin", "group1-shard26of84.bin", "group1-shard27of84.bin", "group1-shard28of84.bin", "group1-shard29of84.bin", "group1-shard30of84.bin", "group1-shard31of84.bin", "group1-shard32of84.bin", "group1-shard33of84.bin", "group1-shard34of84.bin", "group1-shard35of84.bin", "group1-shard36of84.bin", "group1-shard37of84.bin", "group1-shard38of84.bin", "group1-shard39of84.bin", "group1-shard40of84.bin", "group1-shard41of84.bin", "group1-shard42of84.bin", "group1-shard43of84.bin", "group1-shard44of84.bin", "group1-shard45of84.bin", "group1-shard46of84.bin", "group1-shard47of84.bin", "group1-shard48of84.bin", "group1-shard49of84.bin", "group1-shard50of84.bin", "group1-shard51of84.bin", "group1-shard52of84.bin", "group1-shard53of84.bin", "group1-shard54of84.bin", "group1-shard55of84.bin", "group1-shard56of84.bin", "group1-shard57of84.bin", "group1-shard58of84.bin", "group1-shard59of84.bin", "group1-shard60of84.bin", "group1-shard61of84.bin", "group1-shard62of84.bin", "group1-shard63of84.bin", "group1-shard64of84.bin", "group1-shard65of84.bin", "group1-shard66of84.bin", "group1-shard67of84.bin", "group1-shard68of84.bin", "group1-shard69of84.bin", "group1-shard70of84.bin", "group1-shard71of84.bin", "group1-shard72of84.bin", "group1-shard73of84.bin", "group1-shard74of84.bin", "group1-shard75of84.bin", "group1-shard76of84.bin", "group1-shard77of84.bin", "group1-shard78of84.bin", "group1-shard79of84.bin", "group1-shard80of84.bin", "group1-shard81of84.bin", "group1-shard82of84.bin", "group1-shard83of84.bin", "group1-shard84of84.bin"], "weights": [{"name": "sequential/dense/kernel", "shape": [100, 1], "dtype": "float32"}, {"name": "sequential/dense/bias", "shape": [1], "dtype": "float32"}, {"name": "embedding/embeddings", "shape": [290419, 300], "dtype": "float32"}, {"name": "sequential/lstm/lstm_cell/kernel", "shape": [300, 400], "dtype": "float32"}, {"name": "sequential/lstm/lstm_cell/recurrent_kernel", "shape": [100, 400], "dtype": "float32"}, {"name": "sequential/lstm/lstm_cell/bias", "shape": [400], "dtype": "float32"}]}]}